###################### QuestionType Context Help ######################
qtShortName = Eine Kurzform der Bezeichnung, welche es erlauben sollte den Fragentypen eindeutig zu identifizieren auch wenn nur wenige Zeichen zur Verf\u00FCgung stehen.
qtLongName = Bezeichnung dieses Fragentyps.
qtDescription = Eine Beschreibung dieses Fragetyps mit dem Ziel, Benutzer der BME Administrationsapplikation so weit \u00FCber den Fragetypen aufzukl\u00E4ren, dass sie evaluieren k\u00F6nnen, ob sich dieser Fragetyp f\u00FCr ihre Anwendungszwecke eignet.
qtInstitution = Die Institution, zu welcher dieser Fragetyp geh\u00F6rt bzw. von welcher dieser Fragetyp erstellt worden ist.
qtQuestionType = <p>Der Grundtyp der Frage. Dies ist einer der folgenden Typen:</p><ul><li><strong>Textuell</strong>: Eine simple Multiple Choice Frage mit Textantworten. Die Frage kann Multimediatypen enthalten, aber alle Antworten bestehen ausschliesslich aus Text.</li><li><strong>Matrix</strong>: Eine Standard-Multiple Choice Frage, welche mehrere Variablen erlaubt. Die m\u00F6glichen Antworten sind Kombinationen, bestehend aus einer der vertikal aufgelisteten Antworten und einer der horizontal aufgelisteten Antworten. Zum Beispiel wenn Sie fragen wollen, welches Medikament bei welchen Symptomen zur Behandlung geeignet ist, k\u00F6nnten Sie auf der Seite eine Spalte mit Medikamenten auflisten und eine Zeile mit Symptomen oben. Der Pr\u00FCfling kann dann in der aus den beiden Antwortenvektoren aufgespannten Matrix die Kombinationen als richtig/falsch markieren. Auch hier kann die Fragestellung Multimedia-Dateien enthalten.</li><li><strong>Multimedia</strong>: Eine Standard Multiple Choice Frage, bei welcher die Fragestellung, sowie auch die m\u00F6glichen Antworten aus Multimedia-Elementen bestehen k\u00F6nnen.</li><li><strong>ImageKey</strong>: What is Image Key?</li><li><strong>ShowInImage</strong>: Ein Fragetyp, bei welchem der Pr\u00F6fling die korrekte(n) Stelle(n) im Bild markieren muss.</li><li><strong>Geschriebener Text</strong>: Dieser Fragetyp wird durch einen vom Pr\u00F6fling zu schreibenden Text beantwortet.</li><li><strong>Sort</strong>: Bei diesem Fragetypen gilt es, Schl\u00FCsselw\u00F6rter in die richtige Reihenfolge zu bringen.</li></ul>
qtSumAnswer = Die maximale Anzahl an m\u00F6glichen Antworten, welche zur Auswahl stehen.
qtSumTrueAnswer = Die minimale Anzahl der Antworten, die <strong>Wahr</strong> sein m\u00FCssen.
qtSumFalseAnswer = Die minimale Anzahl der Antworten, die <strong>Falsch</strong> sein m\u00FCssen.
qtQuestionLength = Die maximal erlaubte Anzahl Zeichen im Fragentext.
qtAnswerLength = Die maximal erlaubte Anzahl Zeichen im Antwortstext.
qtAnswerDiff = Hiermit definieren Sie den maximal erlaubten Unterschied zwischen verschiedenen Fragen
qtQueHasMedia = Falls die Fragestellung Mediendateien beinhalten kann, k\u00F6nnen Sie hier definieren, welche Medientypen erlaubt sind.
qtMultimediaType = Legt fest, von welchem Medientypen die Antworten sein k\u00F6nnen.
qtSelectionType = Hier k\u00F6nnen Sie festlegen, ob es m\u00F6glich is, mehrere Medien als Antwort auszuw\u00E4hlen, oder ob nur eine einzige Antwort korrekt ist.
qtColumns = Definiert die Anzahl Spalten, in welche die Matrix unterteilt wird. Die max. Anzahl Antworten definiert die Zeilenanzahl.
qtMaxBytes = Setzt eine Dateigr\u00F6ssenbeschrenkung f\u00FCr die Mediendateien, welche f\u00FCr diese Frage hochgeladen werden k\u00F6nnen (in Bytes).
qtMinLength = Die Mindestl\u00E4nge der Textantwort eines Studenten (Anzahl Zeichen).
qtMaxLength = Die maximale Zeichenl\u00E4nge einer Textantwort eines Studenten.
qtMinWordCount = Die Mindestanzahl an Worten, welche der Student in der Textantwort haben sollte.
qtMaxWordCount = Die H\u00F6chstanzahl der erlaubten Worte in der Textantwort des Studenten.
qtKeywordCount = Definiert die maximale Anzahl Schl\u00FCsselworte, welche in einer ImageKey-Frage an einer Pr\u00FCfung vorkommen k\u00F6nnen.
qtMinAutoCompleteLetter = Die Mindestanzahl an Zeichen, welche ein Student tippen muss, damit die automatische Vervollst\u00E4ndigung m\u00F6gliche Resultate anzeigt.
qtShortAnswerLength = Die Maximale Zeichenl\u00E4nge, welche eine vom Studenten selbst erfasste Antwort haben darf.
qtShowAutoComplete = Aktiviert die automatische Vervollst\u00E4ndigung. D.h. wenn der Student gen\u00FCgend Zeichen eingetippt hat, wird eine Liste m\u00F6glicher passender Antworten angezeigt.
qtIsDictionaryKeyword = Ist diese Option aktiviert werden bei der Autovervollst\u00E4ndigung auch falsche Antworten angezeigt.
qtAllowTyping = Legt fest, ob dem Studenten eine Multiple-Choice-Liste an Antworten vorgelegt wird, oder ob er selbst eine Antwort tippen muss.
qtAcceptNonKeyword = Legt fest, ob Antworten akzeptiert werden sollen, welche nicht hinterlegt sind. D.h. der Student hat die M\u00F6glichkeit den in der Box eingegebenen Text zu speichern ohne ein Schl\u00FCsselwort ausw\u00E4hlen zu m\u00FCssen.
qtKeywordHighlight = Ist diese Option aktiviert, werden bei der Korrektur vordefinierte Schl\u00FCsselworte hervorgehoben.
qtOneToOneAss = Ist diese Option gesetzt, ist pro Zeile und Spalte nur eine einzige Antwort ausw\u00E4hlbar.
qtRichText = Ist dieses Feld aktiviert, stehen dem Studenten zur Verfassung von Texten erweiterte Formatierungsm\u00F6glichkeiten zur Verf\u00FCgung.

###################### Question Context Help ######################
qQuestionType = Die Art der Frage, gem\u00E4ss Definition in der Applikation.
qShortName = Eine Kurzbezeichnung, welche die Frage schnell identifizierbar machen sollte.
qQuestion = Der Fragetext wie ihn der Student zu sehen bekommen wird.
qUploadResource = Hier k\u00F6nnen bzw. m\u00FCssen Medien hochgeladen werden, welche zur Fragestellung geh\u00F6ren.
qAuthor = Definiert, wer als Autor dieser Frage angezeigt werden soll und somit auch wer die entsprechenden Autorenrechte erhalten sollte.
qReviewer = Definiert, wer die Frage pr\u00FCfen sollte und f\u00FCr die Verwendung Fragenkatalog frei geben soll.
qReviewCommittee = Alternativ zu einem spezifischen Revisor kann die Frage \u00FCber den Pr\u00FCfungsadministrator freigegeben werden.
qQuestionEvent = Definiert den Themenblock welchem die Frage angeh\u00F6ren sollte. (z.B. Anatomie, Erste Hilfe, Lineare Algebra etc.)
qMcs = Definiert in welchem Studienjahr und Semester diese Frage an einer MC-Pr\u00FCfung in den Fragenkatalog aufgenommen werden darf. Es k\u00F6nnen mehrere ausgew\u00E4hlt werden!
qComment = Kommentar zur Frage. Dieser ist nur im MC-Manager ersichtlich. Z.B. f\u00FCr Reviewer, Administrator oder anderen Autor.
qMediaViewer = Im MediaViewer k\u00F6nnen Mediendateien die zu dieser Frage hochgeladen wurden angeschaut werden.